mu
na
ku
no
pa
nga
kuti
ne
fye
ukuti
ati
elyo
wa
ba
ya
lesa
ifyo
abantu
kuli
kabili
umuntu
nangu
ilyo
bushe
nomba
ni
lelo
awe
umo
joni
pantu
bonse
bwino
e
bantu
janet
pamo
muli
pali
uyu
kanshi
yesu
ca
pakuti
kristu
ine
kwa
ninshi
ico
lya
apo
sana
shani
ali
mushi
bwa
bali
ici
nelyo
fyonse
nao
mukwai
muntu
efyo
nabo
aba
uko
ifi
nshita
ka
calo
iwe
iyo
ukufuma
cilya
fintu
ulya
te
nganshi
bena
mulandu
we
abati
umwana
ala
cakuti
fya
aya
wakwe
atemwa
mfumu
nshi
inshita
panuma
bushiku
yabo
yonse
fine
yakwe
iyi
mwana
mpanga
bambi
sha
mulenga
wine
amano
ifintu
abana
limo
abo
iyoo
ng'anda
onse
cimo
one
ifwe
pamulandu
cine
cilonganino
kwati
shikulu
imwe
ukuba
imfumu
ubushiku
muno
milimo
saana
kwena
ili
kale
musango
nge
ilya
ukuya
cinshi
line
kulya
nganda
cila
ufwile
bwangu
wandi
teti
tekuti
maka
filya
nshila
lwa
ifya
yakwa
ncende
kuno
umulimo
ukwabula
eko
pene
uku
mwine
mulimo
uli
bamo
nama
mwe
bakwe
wakwa
kuya
bene
zero
fimbi
ena
limbi
nalimo
shamitombo
mailo
pe
abena
umbi
bana
lyonse
ngo
nefyo
mano
finshi
fimo
eico
abengi
pakati
ishina
apa
ncito
ee
yohane
panono
uyo
batila
ifingi
shonse
ukucila
bumo
abakalamba
amenshi
nine
ndefwaya
nankwe
babili
mupashi
elo
ilyashi
amashiwi
panshi
katumbi
imilimo
kumona
amona
kano
ubu
naba
dabidi
paulo
ukupitila
umwine
mukati
zambia
pano
ukulanda
baya
australia
untu
mupepi
wena
inshila
mwandi
mutwe
two
umulandu
eco
mutima
ukutila
magazine
inama
amaka
imo
filonganino
kalata
ndi
umukashi
epo
niwe
icilonganino
nakabili
bwakwe
alefwaya
wishi
ebele
uwa
aka
cakwa
lusaka
umutima
konse
mulu
eight
indalama
ukucita
inshiku
eka
mayo
twenty
nshiku
ulefwaya
ifisuma
cintu
pafyo
mpaka
bafwile
lyashi
tuli
cilumendo
mune
yenu
lyena
abaice
emo
bamona
iya
misepela
mukulu
mubili
atile
nsuma
ubwalwa
menshi
ubwafya
abafyashi
ukulya
lilya
bwakwa
abalumendo
ifyakulya
menso
cali
nako
obe
ngacakuti
conse
afwile
umuti
ulucelo
bati
kwali
four
lukuta
imisepela
nayo
tulingile
three
bebele
bwafya
nakalya
ukwishiba
yandi
umulumendo
tata
palya
yali
minwe
isabi
lupwa
uo
balya
kwi
cinecine
bakwa
ica
isenge
ukulingana
bane
mayanda
wesu
cipingo
mushilo
imbwa
kwine
mutanda
cisuma
cipatala
ukukwata
wabo
cakwe
nineteen
myaka
asuka
babo
kumfwa
afika
abali
sukulu
baba
palwa
citabo
ukubomba
ilingi
umwanakashi
takwaba
abene
icungulo
yaba
bwinobwino
icintu
kamo
nkashi
panse
mwinshi
abasambi
ubunte
maria
tapali
ntungulushi
ubwali
thousand
bawishi
senge
bafika
mulungu
ama
cimbi
intungulushi
mufwile
natuleya
robin
milandu
akasuba
caba
ishingi
mweo
cimbwi
kwaliba
imbi
ishiwi
mashiwi
naifwe
bwina
ubulanda
mukashi
lintu
shibili
kuntanshi
ukufika
mulefwaya
shimo
abanakashi
umutwe
kwaba
shesu
mulilo
seven
motoka
lubali
kabungwe
bobe
imbila
bwine
fwe
eya
kwisa
mwaka
ilintu
mwina
icakuti
ibili
ubulwele
nsaka
bwangubwangu
mumana
beka
ayo
mwi
hundred
caalo
banono
banalume
biaolo
yobe
besu
kuntu
icili
kumbi
umusango
ababiye
fyabo
ikumi
baleti
lekana
kwacha
kwakwe
ndupwa
kuba
afuma
kasuba
shabo
lyakwe
balefwaya
bacita
natotela
nangula
thirty
mbila
christian
cibemba
abanabo
paul
kolonavailasi
banyina
takuli
insala
cawama
afwa
bandi
ukumona
six
five
baisa
bamayo
bwinga
ilinso
ukutali
bafyashi
wakuti
ukwikala
misango
umubili
aumfwa
banakashi
yama
nsofu
shina
mulumendo
ulu
leelo
wongo
ubo
uuli
mwa
ifumo
shimbi
ii
shine
nani
tulefwaya
ino
ulukuta
fyesu
namu
isonde
bulwele
ciwa
peter
daka
aiti
impeta
alecita
imisango
baumfwa
acita
kutila
fyo
ayengi
tufwile
amwene
twa
isho
limolimo
nati
kwakwa
wene
cebo
cipya
ubwafwilisho
ifitabo
kalulu
intaneti
mangala
waba
musuma
mwanakashi
alingile
ibumba
cili
noko
mweshi
ulo
isha
bakafundisha
abaume
incito
musumba
cishinka
masambililo
umwina
kapokola
yangu
magazini
amaano
blueville
koyikoyi
umunobe
ubusuma
kunse
mulamu
umwaice
umukashana
icupo
ababomfi
eo
leka
aile
naine
baikala
ngefyo
batemwa
baishiba
kanwa
calenga
mwali
baima
naya
mfuti
bulwi
cibi
baume
icebo
ekutila
cesu
marko
ifilonganino
nkuta
brethren
baishile
nebo
neco
citukutuku
umutitikisha
wakwata
abakashi
icisuma
cakutila
insambu
inkalamo
mwaume
bwali
ngefi
geledi
mishi
fibili
wenu
moneni
bwikashi
ukwisa
lupapulo
ndalama
amasambililo
napa
clara
shi
mulima
lingi
katumba
mipashi
anatole
ukwete
ukubomfya
umulume
balumendo
balupwa
atendeka
mbwa
wali
kanofye
nkalamo
nalyo
kufwaya
asosa
mpili
aipusha
bapwa
atampa
umulilo
soli
ishi
cisungu
steward
ukusambilila
amepusho
icipingo
ntanshi
kulongana
mukalamba
tuleya
lekeni
ndola
lyandi
aima
mufulira
cupo
umutende
bwesu
uto
ukulondolola
bakalamba
umubiye
ubwa
nsala
waumfwa
nokuti
cifulo
basuka
cibe
bumi
munankwe
nafyo
kucita
nanda
shilya
amenso
naumfwa
capamo
amashina
malembo
amakumi
bwalwa
asanga
cikashana
taufwile
umukalamba
icalo
kumo
incende
bufi
balingile
ilelo
ifyakucita
naco
ifipe
umushi
kuteya
imitima
batatu
tonse
cimuti
sembe
nasho
amaliba
aeba
lubemba
kwikala
kati
icikalamba
imbalala
ci
mona
mapepo
umuntunse
fi
myeo
umfwa
ciisuma
koloko
baile
batata
mutitikisha
pio
kutendeka
weka
kwishiba
namayo
imilandu
pusana
mwaice
busuma
mulya
umwenso
kwabo
kutemwa
umwaume
twaba
mpela
bwabo
balecita
shimapepo
naisa
ulwa
fyalo
imyaka
babomfi
bumba
mwaba
mukashana
ndifye
wamu
ukubombela
cibusa
abanobe
ebo
wishibe
uwaba
ishuko
ukuli
shakwe
amapange
umweni
abalume
tamufwile
banankwe
bu
nyina
muti
yamo
balaya
ukulanshanya
isaac
bwenu
verse
fyaba
chintelelwe
bulya
kasama
tumeni
tauni
abatetekela
scientology
linso
umucinshi
nabana
kali
mutende
ubukali
naiwe
kubomba
imfwa
ukupatikisha
nico
apali
ukukonka
benu
balikwata
nimwe
imiti
ikalamba
balongana
ye
mukoshi
iliba
napo
bowa
lino
kupepa
mwaumfwa
yambi
kulanshanya
mafya
ten
and
kalale
kabiye
bufumu
shauli
aleti
abwela
icitukutuku
imfubu
maano
tondolo
pakubala
lumo
akwete
alikwata
aisa
ubwelelo
akashita
umusuma
naku
akantu
kantu
ukumfwa
utuni
bakashana
babula
akamuti
yapwa
uleke
mwenso
yabili
basanga
lyakwa
lwesu
neci
fitabo
mukuti
amalembo
ukushinta
ukushita
church
kondakita
bashimapepo
nombaline
mafunde
cacine
mikalile
abe
kolwe
lucengo
iisuma
ulupwa
insoni
acili
utwingi
ulwimbo
amafya
uwatemwa
ifilyo
fyakwe
isuma
aleya
yena
nsansa
nabantu
ubulimbo
ukutendeka
umunani
munani
yati
africa
bamunyina
aishile
mwane
icisungu
kabiyeni
isukulu
mwisenge
ifishima
ng'wena
uno
mfubu
mipepele
icine
shitatu
pakutila
cibili
bwe
utubungwe
cungulo
akabungwe
bula
icibemba
lwakwe
kanabesa
baleisa
kulanda
bulendo
banabo
lamya
kwipusha
umwaka
muke
cilia
kumwabo
abula
vera
muhenda
nkole
waishiba
ulubilo
lulimi
aikala
bumpanda
mumushi
ukusenda
imiku
kanono
munda
ukwasuka
lyobe
pamulu
ifyakufwala
kufuma
twamona
mpuku
asha
afwaya
capwa
lubilo
wamona
balanda
milungu
nakulu
bashi
bese
calengele
mwenya
itatu
iseni
ukulemba
ciputulwa
aishibe
incinga
kwenda
bakabelenga
kasesema
banda
batile
ipya
isa
ifili
tali
amafunde
bukulu
twali
inkoko
muka
oh
babiye
aleka
kusanga
amalibu
kolona
lyapa
pona
kalyamisha
wicetekela
ukwingila
alaya
abomba
bwaice
uluse
akanwa
mucinshi
mufyo
balebomba
abeni
filyo
nabena
fumo
intambi
umubomfi
ukwenda
baingila
mbali
lupili
ayasuka
munyina
balelanda
baleya
basosa
uwali
kusambilila
lumbi
inkuta
bekala
ulupapulo
amatontonkanyo
pusukilo
aleni
ndeya
cikankala
ukushitisha
bukali
mulume
buula
isamba
malibu
akashiishi
nkama
abaana
nshitumpikwa
munshila
tekwesha
aletontonkanya
mubwafya
ale
cino
akanono
ifyuma
kunuma
abanankwe
icishinka
umweshi
ukusosa
alebomba
tumo
akana
kusunga
naimwe
impanga
impendwa
abakashana
kusosa
bapela
yebele
pabula
pesamba
batendeka
kalya
mama
eee
nafuma
aikele
congo
umuku
yene
cipande
kafundisha
holide
nali
kupwa
ingulu
ing'wena
acitile
bwaba
atwalilile
nishi
kashita
mwamona
basambi
buku
lwakwa
nshilefwaya
tumone
talefwaya
epa
ubuteko
papita
shiwi
bunkalwe
ncinga
atala
abuula
isumbu
ako
kebele
lutu
respect
ahbudula
mfula
umufyashi
ukwipusha
nawishiba
mwabo
natemwa
aishiba
kulaba
ulingile
fingi
ukulolesha
amalipilo
panshita
nafimbi
imfula
niku
amafuta
icikulu
miti
tulya
kukula
fili
alaeba
mitwe
maboko
mateo
nakaoma
nika
akale
citungu
tulemona
fishima
tukolwe
mwaiseni
ababa
muku
ulubali
bafikile
bubili
ukwa
nakuba
babe
hours
citatu
bacilolo
imibele
icimonwa
cenu
mwaishiba
ukukula
shandi
namukwata
nobe
fifty
umweo
bupe
mfwa
lyenu
tebulo
mweni
chomba
ifimbusu
umusungu
aingila
abasungu
nkoko
mpapa
bamfubu
ukwikata
bakapanga
imisepe
cilindi
kasonde
imbushi
mfalashi
icimbusu
fino
ulubuli
inkongole
ilipusho
iingi
kukwata
uukwete
cabo
ifishinka
ninani
naishiba
kumwakwe
kobe
ukubika
cilye
imbuto
umulopa
abalwani
yalya
baice
mwela
tuni
basha
apakalamba
epela
ukwimba
chisha
mbalala
lampi
mumbali
twaishiba
balelya
ukuboko
kwesu
america
ashile
bacitile
ukutontonkanya
balekabila
eighteen
afikile
muputule
samwele
ma
imikalile
makamaka
mutundu
he
ukupa
kandi
musebo
shinga
aebele
tabali
batetekela
batumwa
nokutila
yanda
mukumona
ukweba
auti
ubukulu
mwakwata
nifi
cipuna
ukubelenga
bunte
imyeshi
eighty
kapenta
umunabo
baleta
kapela
amasumbu
cembe
kapala
icipuba
naani
viloto
nsangwa
umukankala
munobe
ubufi
abekala
ukukana
lubuli
bwaca
ifipya
bakashi
kwisano
alelanda
imipashi
abakote
cilingile
nshishibe
mumilimo
alekabila
akwata
fyakulya
ameno
busanso
enda
neka
icikankala
nsoni
bafwa
mukolwe
yeka
asumina
niba
epali
tumbi
lushishi
pantanshi
ukulila
ukwipika
ateya
munabo
liba
bele
ayasuma
twaumfwa
akati
katapa
alepepa
icali
tulo
kaino
ehe
nokuya
munshita
ululimi
pensulo
ikala
fibusa
amayanda
ayali
imyeo
kubila
noku
tefyo
cikope
mark
ulubembu
lubembu
fyali
yasano
fourteen
ukupepa
twakwata
bwandi
icishima
yehoba
bakapokola
bible
ukalamba
amabumba
iye
ukupekanya
editor
ubulendo
afumine
mwalishiba
napapata
aye
abwelela
shakwa
basi
imbileko
kupela
badikone
babika
alishibe
icikope
membala
lwimbo
amone
mr
ukwipaya
apita
akaice
kubwela
babwela
ukusamba
musa
afiti
ng'uni
masumbu
mulundu
cishilwa
busha
amasuku
sempya
baali
fika
bucinga
ukubutuka
inganda
umunandi
uwakosa
mfuko
mubiyo
nsoselo
uwakwata
icibi
munandi
namaka
umukote
mupalamano
taba
umubiyo
yantu
wacita
bumbi
ukuupa
mumpanga
ififuma
akwate
kumushi
amalwele
ubwingi
asangile
cena
atontonkanya
amate
nensansa
cilemba
cingaba
mabumba
lucelocelo
icantanshi
bateya
mabala
imfuko
icakulya
umupeto
meno
cibinda
baleka
masako
maliba
mashina
iciibi
asosele
umutali
abanandi
mpumi
cipuba
icongo
twishibe
mwikala
naile
baikele
batampa
inga
phiri
walishiba
matontonkanyo
fisuma
nokuba
fweka
ukunwa
ukutemwa
kalemba
ukupeela
icilangililo
candi
fifteen
takwete
northern
province
sambililo
kushitisha
bamone
ifibusa
ce
kubombela
mibele
impiya
ro
school
emmanuel
chitalu
bakwete
sabi
abasuma
kusenda
balembele
buteko
mafuta
ndoshi
webo
banamayo
cmml
babwananyina
mulopa
kesu
fishibilo
ese
lwabo
balafwaya
bafwaya
banensu
ubwinga
ifisabo
mutengo
mukupanga
nomo
tulelanda
kitwe
kupunda
aikata
yadi
jaivi
kulila
nifyo
alungama
aibukisha
asenda
inshimu
inoma
abalondo
basendele
banyinabo
inanda
kuta
mpeta
kuu
mpango
aali
anastasia
umupunga
aaha
abange
akula
tapaba
buko
ukufwaya
cintomfwa
ubwasuko
bwaila
buce
muncende
ukutwala
baipaya
uushumfwa
pakulekelesha
ifikolwe
alishiba
icifulo
umutengo
iinono
ukucetekela
uwakuti
kuncende
mbushi
ukubikapo
ubumi
wafuma
balala
utulo
nshikwete
ukusuminisha
beshibe
lubansa
kubwelela
mushili
tubili
kufwa
umucele
impuku
bwapwa
matwi
noma
umupila
station
mubiye
bakumana
kalambo
inyanje
bala
umupashi
kwenu
emulandu
ubuyo
atendeke
kubomfya
fikansa
bumuntu
ndeke
cilifye
tamuli
bakolwe
kulenga
nici
apeela
chande
intu
luntu
bwelelo
ifilangililo
kusambilisha
ifyapala
bwite
amapepo
bakalemba
yaisa
ubwikashi
abalupwa
mepusho
cingeleshi
kwafwa
umunwe
kabilo
ing'ombe
foni
namwishiba
landa
mose
tatulingile
mako
bamembala
bakwata
luwingu
yaku
bwalya
twatemwa
twaisa
emukutila
waisa
utu
ulupiya
tamwishibe
alolesha
twalikwata
kunwa
bakomfwa
balenwa
insansa
kucingilila
muntunse
icitupa
go
kulyo
pabili
aitile
batini
lupi
aleta
mukaya
lyabo
wati
abeba
ele
nkaya
nkosi
chembe
bulanda
amakanga
insoka
isembe
ifyuni
tu
ibeta
mubansa
mpandamano
mana
mwingasanga
mulelanda
nokumituma
galyati
shaani
lumbula
nsalu
patili
hugo
bataata
akamwana
cibwabwa
ulekabila
utunono
kusuma
ukulaya
nangufye
icabipa
cabipa
babiyo
cifungo
ukulwala
takwata
tuutu
ukuleta
ulecita
fulwe
banoko
ngolefwaya
nikwisa
ukufwa
mwibumba
ukusangwa
mwapoleni
imbwili
amaboko
ukuleka
apela
ukusanga
bashala
balandile
ubupe
abakulu
kapaso
ifibi
mfwile
malwele
ukuteya
cikanga
icishele
mitutu
kwangala
kusamba
kakwe
ifikwa
ulushishi
apwa
pakumfwa
bema
akatalamukila
namumpanda
umumposempose
balabwelela
mwaisa
yafuma
numa
kwimba
intanshi
kusendama
malumbo
ubowa
mwandini
mwamba
kulima
bafumine
katayi
lisuma
kwima
ababemba
muleya
twafika
caku
caawama
muci
mubarak
b
iikalamba
kucila
yakuba
twacita
ubukankala
abrahamu
ukwabulo
ifikansa
amakalata
cibansa
benda
bani
shaba
citila
bumpomfu
kabwe
mufyalo
to
forty
alandile
njikala
sixteen
kupekanya
balwani
kuleka
mwakwe
cilubo
umumfwano
mwilaba
kasebanya
bwikalo
kwaleba
john
yane
twelve
sonde
tube
yapa
basungu
mikoti
ukutotela
icitemwiko
butungulushi
ukupokelela
kubelenga
li
ninety
ng'ombe
icipande
nafwa
mwalanda
mulomo
kana
luapula
nambala
mukufwaya
inshi
nibanani
aleenda
abatumwa
cilepilibula
fyakwa
ukwishibilapo
taishibe
aendele
ndeti
lungu
kolala
napali
kuboko
katwishi
aleisa
bacili
nabwinga
shino
citetekelo
lilali
mwesu
mumulimo
alembele
tulekabila
bubomfi
ekala
ukupanga
lyesu
ifikankala
masambilisho
mulandunshi
mwalo
aipwishe
icakumwenako
abala
mukutila
mitima
mufilonganino
shifwile
mobe
kushita
apoka
thorncroft
musana
bapalama
musungu
kena
apanga
mubemba
babwelelamo
calici
umunensu
camupesha
tii
endita
umulwele
citesheni
ishitima
balume
shitima
muulu
kantunse
kapoli
fyamona
aciti
kene
fita
imilomo
batola
mpundu
tabalaba
imishi
mwisamba
enshita
mwaliba
icaalo
kamu
akabombela
mukupanda
kulungana
kalapelako
bwampano
inkalata
nje
ferdinand
panoono
kabara
yoani
temu
uluceelo
uunhu
ababiyo
wamaka
ucenjele
mukubomba
nalelo
ukucenjela
ilingiline
kwata
mukulanda
lwandi
wabomba
ifyacitike
ukutuma
abaupana
uwacenjela
ubucende
pakutendeka
ukufilwa
ecalenga
uwabufi
ukwibukisha
yakubomba
ifimoneka
mwaya
waenda
alifwa
icibusa
umulongo
iyabipa
lyonsefye
yakuti
baishibe
ificitika
insoselo
ukwendauka
ifilubo
nokulanda
umulunshi
kukulongana
alya
umulwani
muma
mukuba
tabafwile
ficita
bulimbo
mushitu
ifyaba
ciibi
utupe
kwipika
kalundwe
ifyumbu
bwendo
kwipaya
kupama
impepo
babwelela
bengi
fimofimo
akaka
monse
banaka
yaya
kwikata
ani
utwa
batontonkanya
lwine
musonda
amakasa
cita
umoumo
afwele
manika
abwelele
ilampi
uleumfwa
atumine
kalasi
namumfwa
shalenipo
nalanda
amapi
ukusakamana
mwibala
nyanja
amashindano
babomfya
mukulekelesha
fyakucita
ing'anda
imipepele
ifyali
abashala
amasuko
kukabila
bwafwilisho
baminshoni
south
ukulongana
abekumi
kukuba
ceni
mukucita
atena
satana
inono
cishima
apwile
nkumbu
umunankwe
cakumwenako
cinso
efese
ukulanga
lonse
nifwe
paba
isambililo
butatu
fikomo
munyinefwe
ima
iyingi
mukusambilila
apabuta
mapange
abacenjela
lutampulo
kweba
shinono
lyali
bayamba
olo
incite
umu
mpelako
shili
beta
malaria
mwenu
nkonto
abaishiba
kabanga
ubuntungwa
mansa
icipatala
mumusango
icimbwi
fwebo
wasanga
cobe
yu
kacema
mupusushi
kabo
ububomfi
lubatisho
ilikalamba
ubukalamba
funde
likalamba
ifikope
umupya
fipe
makwebo
twapitamo
ofeshi
tabakwata
let's
myeshi
bekale
ukusala
abomfeshe
kasambilisha
kulanga
ululumbi
uleisa
noyu
ukwampana
samfya
tabalefwaya
baye
fifulo
pambi
asantika
bakapenta
bafuma
aseka
balanwa
amolu
evans
afilwa
alomba
canda
cikulu
akasungu
nabekalisha
harare
bayama
utwaice
amalaya
ukuyafika
banafyala
ukufwala
nacine
wapwa
cikini
nishani
kalwimbo
alafwaya
indeleshi
maliketi
bukwe
beshile
mulanda
mitanda
mafumo
banshimu
basenda
ifyula
lye
mulongo
bamobamo
kamuti
nyinabo
luputa
libililibili
umufwi
wiso
mapeya
eba
kwikoshi
tumineni
icitundu
ifyupo
bashilika
ubulwi
chozi
bakaya
yanga
abatuntulu
kaitali
kutifye
lufonsho
kaoma
cishiba
amelika
peace
corps
patile
dadi
ooho
ukupwisha
mumaka
ukufikilisha
wailetelela
mala
ukwafwa
ubucenjeshi
fyobe
uwaishiba
abakwata
ukulenga
kufyo
nabambi
tala
wasuka
ukucusha
namano
icilubo
ukwangala
pakukwata
mpakafye
ukufisa
balemona
uwacita
utwakulya
washa
ifilambu
nokumona
babomba
kutala
abashilika
uwakaso
icakosa
kabengele
walikwata
fibe
ububi
mpeleniko
mucalo
umubi
bwingi
cacitike
basumina
pakuba
ubuci
luse
munganda
indoshi
afyalwa
shamo
ishamo
ukushimika
ukupita
ukulaba
talaba
pakanwa
nshili
mwishibe
ineine
ulelanda
bamu
ciko
tukaba
nayambi
kutali
amalumbo
apelwe
nakwata
tafwile
tubungwe
yakwata
imoimo
umusalu
babuula
icani
babikamo
iloba
lubuto
bafumina
ashimpa
kuulu
fititi
amendo
ke
ubukungilo
kanje
yatendeka
amangalo
fyangalo
nsupa
chilufya
aciba
bapoka
atila
bashifwe
ncengo
mwena
cola
endesha
fimbipo
kusuba
basangile
bamwene
waya
abafwa
bamwita
mulemona
tukamonana
kaili
pakumona
muleumfwa
ingila
cimbusu
atampile
nalacita
amataba
ninshita
mukwafwilisha
tuye
bwasuko
ndelemba
ifyalekana
buli
makasa
fyupo
lembeni
ukukalamba
twiga
mbwili
new
ukwali
cipandwa
bufwayo
twasambilila
mubwikashi
asukile
kufika
ululi
ifisangwa
seventeen
simon
iitali
twala
mibombele
amasambilisho
kulolekesha
chapel
kwaliko
ubwite
ifyabupe
abombele
kulemba
kutuma
babombele
ukumfwikisha
bemba
nibani
baibele
pepala
kenu
ndimi
banga
mwebo
lyaba
natumone
programme
ubutantiko
mwishina
amabuku
amapepala
lwendo
ha
manje
ubunga
niwebo
ndelomba
ukumoneka
fyapwa
twaya
amalyashi
bamupeela
icilibwe
bacite
ipusukilo
ishalekana
cifwile
abalefwaya
umutundu
minshoni
isano
baumfwile
bale
pabushiku
musange
cintobentobe
hpcz
of
pakuya
january
naima
ncili
tabakwete
mwalikwata
esho
ubuli
tukaya
yese
iyalinga
kube
aloleshe
ekele
ubupilibulo
twibukishe
kusala
ifita
afililwe
pafya
libumba
mumfwano
petro
yakutila
atuti
twilaba
abakwete
kabatisha
lili
yatatu
nsambu
tutu
cakulya
ifikalamba
nenu
fwaka
bubi
ndakai
cibelushi
evangelical
shibo
baita
bafwaisha
icilengo
ifilefwaikwa
chapita
luanshya
bawiso
atemenwe
mulwele
amwebele
alifililwe
twise
kukubila
ngulu
icakucita
misepeela
abalanda
nalo
fwebene
jonie
banina
ubusaka
mukote
ikofi
bakanyangu
ashala
alamwipusha
nail
kapanga
tumfwe
amwipusha
alamona
apunda
uye
walya
anina
ata
yasuka
batemenwe
atuma
namona
balelolela
mrs
abika
taibula
zulu
sutikeshi
balaposhanya
abwelelamo
imbale
mwansa
nasenda
kumwesu
fifwani
basano
cabula
amafumo
bankalamo
cisansala
fyuni
umulungu
kulunga
yafika
kabula
yaipaya
yalungama
cimpusa
shikitishikiti
bashibo
ukuta
butete
samba
umubansa
akoni
pala
nda
nseba
cabu
ifupa
ikula
mukanwa
ayambula
moona
mpanda
uwakumipilibwilako
namafunde
fyakupatikishiwa
australian
ukusembululwa
ukuputulwa
pelishiti
munakwe
sixty
namaayo
chunsu
nacisungu
twafwa
makusuli
inkondo
cilimi
amonafye
kamba
mashetu
amakufi
akashimi
ulelilila
akulye
nakasofu
rhumba
nalitemwa
lipya
utubowa
kumilimo
tekala
bomba
ubombe
wacenjela
akasuka
bakeshiba
nakuli
ubufumu
afwilisha
ubwikalo
ponse
tawishibe
libe
bucushi
uwamano
yabipa
waleta
filubo
cikaba
waipushako
ibomfiwa
wafika
asokolola
icipyu
uleya
cikalamba
ukukosa
mumulu
ulebomba
bucibusa
ishapusana
wabombesha
yasuma
ubuyantanshi
uwakakata
pambali
nasumina
icuma
kubantu
utusuma
kulolela
tawaishiba
nshakwata
fyuma
iibi
nokwishiba
ipaka
ukulwa
nshifwaya
ukulipila
mubusanso
umupina
icabupe
nabanankwe
ishamfumu
taulingile
nabakalamba
imbali
ukumonana
banobe
ukuibimba
ukutinya
apabula
icilambu
beni
amabu
ukulaala
asendama
kumulu
kutontonkanya
ukubyala
twati
uwabula
ibi
nokumfwa
alila
tuntu
buyantanshi
ukulumbula
alefwaisha
mafupa
utwakuti
ifiswango
wisakamana
insele
ciswango
nokubomba
lobe
talingile
kupanga
fimuti
bwena
baipika
icayanguka
utumuti
mabuula
maca
batwala
baleyangala
kuteka
akaba
buntu
imicitile
caiko
bwaiko
konsekonse
bapelele
ukulengula
umwela
yaima
kucincila
nshaishiba
muto
ubwendo
akakile
kukaka
kusuka
masukulu
mwati
wakutila
kutamba
imfungo
balekula
tumotumo
njelela
yabwela
baumfwana
tandwe
baleingila
atoota
ceka
nafwala
mwashibukeni
abanensu
umwinshi
cipooma
icisoka
ibala
amale
uusuma
alesosa
tabaishibe
baiposa
omfwe
tupe
baloleshe
lulya
shuko
kufwaye
nkuni
ukaya
mbokoshi
ikali
indimi
naena
landeni
miku
kusukulu
ninebo
tauli
lala
ilembo
ukunaka
aposele
kundapa
ukubikamo
bupyungishi
kusha
ukulungika
kulundapo
bashile
ukupyungila
pebula
ndesubila
asalile
ayaatwa
tutila
bubifi
centre
bantanshi
samwata
ayakalamba
amakana
luka
mukwipifya
lipilibula
ukuposa
ukwafwilisha
nefya
catwafwa
cilolo
abomfya
mulekabila
kubalilapo
ukukumana
bauleni
national
bakabolala
micitile
apokelela
calola
ukutwalilila
mulubushi
apepele
kabumba
alesambilisha
ukubamo
mukuni
benga
bapeele
chapter
chingola
icitabo
ukubikapofye
mwape
ukulosha
kusonta
ukupilibuka
nko
copperbelt
mulalilo
ifilundwa
kusoma
basambilile
yakunwa
cina
imyendele
abafumine
korinti
ipepala
banani
uwawama
mukulemba
kwalifye
nokusambilila
hmar
asambilile
bamwebele
ukusumina
tontonkanyo
lolesha
fwaya
kamana
nacilafwaya
unga
naciya
tawakwata
nala
ninkwata
wishile
eyo
ntambi
ukushintilila
atweba
myabo
palwalala
ukukoselesha
tababa
apangile
citika
israeli
ngacakutila
buyo
yuda
abebele
chinsali
seventy
kuleta
balabomba
district
filling
baleshitisha
basosele
taata
nalaya
naingila
balifye
ucili
iminwe
mwaile
cililo
cishibilo
takwali
fyanso
kafikenipo
kwasuka
aingile
lyalola
ukubila
kulondolola
abamushilo
catendeke
batendeke
cifuba
ilingile
kusumina
kwingila
kushimikila
lipusho
atupela
wamushilo
alanda
shila
kushika
itali
mweka
aiminina
tabaishiba
twikala
twalalanda
yapya
nafimbipo
citupa
tulesubila
lwenu
ron
hubbard
papite
ifikumine
mucitungu
mufya
mukukansha
alemoneka
mukwangufyanya
emukuti
intunga
balemba
tulembeleni
kupilibula
kubika
kubatuma
ubulondoloshi
ifilengo
kucimfyanya
abramu
mukwete
kutwishika
mulingile
ukulomba
kwipushanya
uwasambilila
kabila
kuso
kulala
abatume
balekana
icalenga
mululimi
aleumfwa
taumfwile
nalala
umumi
baibo
abalekeleshiwa
kumoneka
abulile
caisha
natukwata
banandi
fitatu
apalama
pompi
kuwa
salisbury
bukapenta
kuseka
shingi
ashitile
batala
cintubwingi
awa
alatontonkanya
ingileni
monyoro
marara
tacilingile
myona
miile
boyi
ayabuula
nikwi
aletiina
van
ersen
co
njishile
japhet
katundu
balalya
nabwela
nseko
bamupeele
nakaendi
munensu
bulandabulanda
mupamba
amasange
malaya
lukasa
umone
elizabeth
see
aleimba
kwaisa
utuntu
ashaishibe
alelya
alaba
nabaya
kubwekeshapo
atwala
nakalyanakalya
inkoloko
twakwe
shimona
baenda
kuupa
tom
amala
icimuti
namo
cakolwa
fupa
mulamba
baeba
amani
pati
kuilombela
kabukwe
kamona
yapona
utunama
inkuni
fiswango
ing'oma
kashimi
imifwi
mifwi
amasako
bapuupu
in
akambe
ifisaye
babala
kulu
ulupeta
mulambilwa
cibolya
baluba
kutola
male
basambilila
miseke
tunono
balosha
asabilwa
insaka
tabalala
icishiki
ukukaba
buulwele
china
ifikwete
ilyoline
abacetekelwa
tabusuminisha
nobunkalwe
akapatulula
ifitundu
ilyaba
cilapinkana
cakupatikishiwa
uwo
my
ifyapusana
lgbtiq
nabanakashi
taulefwaya
kucimfya
paka
mulwani
tanzania
bakula
akakulu
coordinator
amalango
bamaayo
cileshe
nakula
cekapu
cipisoni
nshikunkulu
mfuli
nkondo
mukenda
maindo
irene
tukondo
twange
yombe
abayeke
abalye
naka
kaipeela
banaani
muleba
amatoloshi
utuputula
impoto
bikeeni
kaisa
tubowa
nde
bawisha
ingoshi
cimpindu
pindulukaee
nshikita
ukubala
ukubangilila
wikokola
tailapwa
ciine
takwawama
wafilwa
mwenda
ukubikilila
wapanishamo
ukwakuti
ngawabomfya
iyalungama
ukucindika
washukila
wisula
bakota
macushi
kabela
palwakwe
ngafilya
aimona
ngawatemwisha
tabalingile
ukulandalanda
icilye
teiwe
ngatawishibe
lyakuti
aupwa
talipo
tatufwile
palwabo
abashili
uwayafya
batiina
nakale
citemwiko
waita
ukulolela
iyakuti
ukwate
bamuka
umusha
bamupela
shibwinga
cipe
waipusha
ube
ubucingo
uushili
uushifwaya
waluba
bwalenga
nalya
wakosa
akasuma
kupya
kusangwa
uwashipa
ifwile
wikele
abuka
ukuwamya
uwaya
ngabalelanda
kumenso
uulanda
uutali
imiseke
ukumwafwako
nkongole
umupwilapo
kapingula
amoneka
aliba
uusangwa
fyenu
ishisuma
ukupunda
caali
beba
mumulandu
ukufunda
kulabako
pamofye
ubusoko
ciba
akakuti
ukulima
bucintomfwa
ubunkalwe
umushili
ukusunga
mulupwa
walintemwa
ubunonshi
uubi
watala
afumya
icitumbi
ukwima
afwaisha
kupaapa
ubucushi
bucishinka
ukuluba
alemona
iyabula
lunshi
myenu
ukucilapo
sheka
cilonda
lisambililo
ashuka
iikulu
munonko
winewine
indupwa
uwamaka
filamba
mibundo
nato
cikanda
bakoma
ukwangalila
bakwate
bayangala
twabo
bakulile
busaka
masange
mainsa
mafi
bafumya
bapitamo
cikwa
kulengula
ngomo
balengula
tamwaba
tulumendo
amasembe
bukungilo
basalangana
kanamupilikisho
akakila
bulyo
mumposempose
aisapisha
kufulumuka
naifwa
shaya
munwe
ciyanda
kutoola
nyimbo
fyafula
mutale
baleimba
baleke
fipooma
chishimba
shena
engile
umunenu
twashala
insalu
kukati
natumfwa
twalishiba
yaponena
tulamona
bapanga
muyenge
wafwa
kulekelesha
tulandile
bamwipeye
banenu
mulamona
talya
adam
inkaama
mbuto
muletontokanya
mwafuma
pakweba
kateka
waku
nacilanda
walanda
alomfwa
ukwamba
nefi
twalaya
tota
bonsefye
mwende
mukese
tulesambilila
mulembe
cipimo
ukushupikwa
muficitwa
abaibimba
tulemonamo
ukwimbulula
yerusalemu
cayanguka
konaula
fyakale
ukulolekesha
germany
mukwenda
bamuninefwe
twaleni
icipya
mwilangi
upya
twatotela
panshiku
umulando
calila
lyo
indyabuluba
yacitile
lwaba
membu
ukubwelelamo
kelvin
aileba
nokwisa
tusanga
ukuipela
caliba
shifwe
ukutungulula
kakwa
aloseshe
loti
ifiwa
ukwikalila
akaya
aliya
alondolwele
kufikilisha
daniele
abomi
bukata
bulesa
nefilangililo
george
pita
panganda
kuku
kwale
balefwaisha
londolola
hivaids
subilo
ubwina
lutambi
yakulongana
september
mucipingo
obed
yafumine
bapele
bukankala
icitungu
musonkano
wantanshi
miputule
iciputulwa
twalekwata
mibili
ishibikwa
ukupwa
ishalekanalekana
mukusambilisha
cabulanda
fifwile
fisano
balile
cilibwe
akeyala
buseko
ukulapila
imembu
number
abaleisa
gabriel
yakufyalwa
kumweba
baleikala
munshi
uukulu
lulamba
nasanga
twafikile
peshilya
mulemoneka
baku
yamusango
noti
camoneka
teifyo
naciba
nifinshi
icinecine
ope
ta
ndume
leteni
bika
kuma
sitesheni
mwatuma
basuma
ninjisa
town
wanu
shobe
uleti
robina
monica
ifyakuti
ukuluka
ekuti
masoshi
taumwene
twafuma
muleibukisha
tucite
leta
basuminishanya
nasha
ukubikako
senda
ifyashala
amakwebo
tubomba
misumba
kwafwilisha
kukansha
uulefwaya
uweshina
imibombele
kamushi
kukulyo
baendele
chawnga
bakashimika
ifyakubelenga
edgar
twalaba
bwalelo
pf
yaishile
bomfi
ecalengele
so
hospital
abalwele
boi
ipaya
insalamu
mapalo
uukalamba
peka
pakukula
shintu
caisa
nindonga
umwele
nalume
tiketi
icoola
nafilwa
acisa
eshile
mwabombeni
yalifye
munga
iyashala
kuposa
ulemona
naishila
apopene
kakulu
ilambo
butandashi
kumupela
ukutina
aimya
balola
mabula
impalume
ashele
basangwa
calolele
bupilibulo
ficitika
betwa
babikile
mukate
ukusambilisha
kukonka
abalingile
bamushilo
tucili
alondolola
ukwishibo
tumona
fyafuma
ifunde
yakulanshanya
cilefwaikwa
batuma
fyakufwala
ayalekana
ubupusano
tulecita
tulande
bomfyeni
akapya
mucine
pantashi
bulimi
ouy
amabula
bashitata
twapapata
balefwayo
icitetekelo
bakalenga
munenu
mucita
musambi
bukalamba
ficitwa
yakobo
cilangililo
vesi
twalanda
shikala
bwipi
bwakonkelepo
kwesha
kapinda
kwaishile
bakasambilisha
icishiba
fishilano
imilumbe
mumikalile
bamusango
neli
akanshishe
icabubili
musha
patatu
baleumfwa
ukupashanya
tamwakwata
apele
bengomfwa
mukupeela
tuleeba
icalengele
alikwete
mwasanga
neyi
cipangano
twalemba
namwene
aiminine
fyandi
imbokoshi
nabekala
twatila
filimba
yaliba
balishiba
tatulefwaya
akuba
afunike
kwendela
ulukalamba
ngaifwe
kushininkisha
iili
tulelya
ukulesha
milomo
talati
mpila
petauke
mabotolo
fyena
bafwala
bapwe
citenge
ingoma
balecinda
kwashala
yalila
wakalipa
few
cinono
baiminina
kofi
shati
apilibukila
balaseka
nashita
bucebuce
kwinuka
kutampa
nasantika
aposa
nook
fyaya
limbilimbi
twapita
waleka
fyekafyeka
mwatesha
ayapona
ashifuma
nalikutemwa
alala
ekale
bushica
atalala
kumfwana
kadona
naendi
musowa
kubuula
babemba
kumuposha
matero
lumbwe
bashifyala
ifilamba
baleeba
impango
uwaupwa
ayaluka
kushimika
bamweba
bushilile
mupila
canakashi
bwana
balepita
ashininkisha
buleca
ukuupwa
ulelya
wabalilapo
alwala
umunkoyo
yawe
fyabula
akoola
twende
beti
itoloshi
alebwela
kwalula
natesha
twaice
kubeya
yasosa
pamwabo
basisita
namutekenya
kunina
takokwele
euku
mweba
aisafuma
cipyu
ashipwa
yapatila
fyula
bakona
mulopwe
milando
ifibuula
yaeba
nsefu
sumbu
pafuma
nkali
kaice
amafupa
cilamoneka
ing'uni
yapela
muluba
kwaletwa
mato
bapita
iwa
cati
hehe
yafiko
bepeye
aupa
bashele
bayasanga
aipaya
ifisashi
amapanga
njino
lubelebele
luncecesa
bacinda
mwatalala
fiwa
mufwi
mwinemushi
mwise
iciswango
bamutwala
nduba
bashinguluka
balefwaila
baimba
utumashiwi
nambushi
kaya
bekabeka
icisaye
eleli
iyeleli
cangalo
bacela
balata
kulwisha
ubuta
filindi
bakapala
umusebo
inkumwa
bulunga
ushili
ukunaya
libili
tausala
musunga
umuto
nalemba
ushitasha
ifilembo
akafumbe
ngatwamona
eshibe
bakantwa
ubi
epabukulu
kubana
kekele
mishila
kukakata
lubumbashi
baletucitila
kasuma
ebushiku
kabundi
kunya
umukulu
ubwaume
kashiishi
ukwapona
kutesula
ifiteekwa
muletunganya
ngamulefwaya
asumine
ubwampano
utwingafwilisha
ukupilibula
akakwa
afp
mwalibako
wwwhomeaffairsgovau
blue
sky
fitupa
icintinya
pamukoshi
abantungwa
mpika
isreali
mulalo
alefwayafye
kasuli
alwile
ukucimfya
insa
bucenjeshi
tatwakwata
natumfwe
kula
mimana
shilingile
twaile
ciimo
beena
imba
pounshi
wele
mwakaba
christu
kapumpe
cinoono
cabwela
tubekate
abawe
paki
kashimoyo
baleyafye
cinshinshi
bamuteka
kayanda
engila
balande
vigodolo
ofisa
at
kulosha
cuulu
campa
hotela
bisiketi
'ishina
ulembe
chalimbana
wamilimo
twikatane
utumitwe
buka
taya
buta
apafumine
asendwa
konkola
bakalimamalungu
cele
cibuye
umfweni
nabwalya
ukupolomya
insapato
dora
bashinwe
njeleleniko
imbabula
nabomfyako
tentambi
maliila
mpoto
palwino
nakena
lubumba
mami
cipango
uyoo
ulusengo
utubundi
kalubalabala
kaluntensha
apeepa
mwimona
nemwine
bakankala
mubwikalo
asapulula
ulabe
kukosa
nganaukwata
ukubombelapo
mukalale
wabepa
tekuli
tabamwishibe
ifyalubana
wingacenjela
ukucenjesha
nefyakosa
bulupwa
pakwikala
mukulwisha
ukupusuka
ukasuka
amaliila
ifishili
aleshiba
walaba
nokufwa
pacalo
akafyalwa
kutusha
icitwa
mwalundapo
ubutala
nawena
witila
nalimbi
wanguke
bakwafwako
ifyacishinka
ufwaye
wasangwa
anwa
bulalelale
kwandi
pacifulo
natulolele
wingabomba
filapilibuka
ukufyuka
batina
nakasuba
mulyashi
mucilye
ukuipekanya
umushimbe
isubilo
wabikisha
engacita
baleshiba
ukwendesha
mumutima
ukulufyanya
uulenga
wamisango
ukuyafwilisha
waupa
uwashuka
mwingamucingilisha
likamukonka
ifimbala
ingombe
tabwawama
alufyanya
uwitwa
ubusanso
ukubeleleka
uwacishinka
sakamana
nokusunga
wanonka
ushishibe
baupana
ukwesha
mucupo
taukwete
abikila
ifyabufi
baleishiba
palobe
ifyakosa
uulufyenye
nomuntu
tafiweme
mukumoneka
abaleya
nomulandu
kwalenga
malyashi
cabubili
fyayafya
fundi
wilacetekela
umuyila
walimo
ashishibe
uushakwata
wemwine
asangwa
cipesha
mukulandalanda
kubili
into
mwefu
shinde
akasembe
ukutema
sawe
yababiye
abekalamo
nakuntu
kutula
pancende
nokufwaisha
tapaashala
ubwakosa
walanga
uwasalapuka
aikatwa
nokulya
taisala
mukubombela
balemufunda
alafwa
kangalila
uuleta
tawililafye
engabutukilako
ngafyashupa
kwempe
ukuposha
pakwasuka
amatwi
icilele
mulando
ipinda
abapuupu
miponto
ukwafwana
ukubwelela
watendwa
uwabumi
ifyakubomba
pafintu
abakosa
ukusebana
ekateko
yabantu
ukwanishe
umona
amasakamiko
kubanobe
atendwa
tamulya
tatwishibe
kumaca
baposha
webeli
bucende
nshilati
yamoneka
ukupela
ukusansamuka
wabene
kukubomba
ulubuto
uwalwambo
yekayeka
tasakamana
alubile
nalintu
kukana
walyafye
ifimoneke
shilamona
mufyashi
shakubomfya
kumutwala
shapusana
wambwa
bakalipa
katabo
ipusheni
njishibe
amamba
batwa
basala
mutanu
bwinebwine
twaikatwa
balasenda
iyalekanalekana
balebuta
ifimbwi
bamukolwe
balumbwe
cafuula
tabalaima
bacisa
nafiwama
shimoshimo
kulolesha
abacincila
balyako
ukunona
bekele
kusakamana
ifibombelo
mansansa
kubalesha
uwanaka
ipita
ituka
kanya
mfifi
tayakwata
bafwaye
tusembe
libela
utupunda
impela
akakota
alosha
kalume
babalilepo
nakanda
waingila
waiko
yapita
yasanga
kuputula
ukuputula
balelengula
bapokelela
bepika
balatemwa
asuma
inkasu
baleenda
mishita
aseba
akamusebo
mushita
kanamunsanki
tafifwaikwa
ibiye
kwimya
ndafwaya
nse
ndiminwa
mpulilwa
tailya
shafumina
shaumfwa
ubwema
tusende
ishele
a
u
lwanya
icinwa
teka
tutile
kutumpa
njele
nyenjele
bamwana
mulabasa
twanaka
makumbi
natulecita
batantama
alelumbula
fyatendeka
malabi
icele
twaumfwile
paali
imito
ishituntulu
enga
cimbicimbi
kalishiwi
paya
lileba
balaisa
bayasuka
imilungu
alepepela
ailesanga
icabuta
mpande
umutanda
umumana
yalepona
alimine
alelima
natuye
alolele
twine
kupona
libi
chishamutima
tontonkanyeni
imibili
kulota
watiina
ifye
ufimbana
ciloto
misangomisango
kulwa
umwipwa
akamuupe
alyumfwile
alekaka
balima
babyala
nkaama
yatuma
mito
aleikala
mubutuke
iminineni
natucelwa
nibanga
wacelelwa
galedi
nemyaka
'shani'
imakaneni
neminwe
ndecita
kushelefye
kumi
kukabanga
alibelela
emutundu
wasuminishiwa
ifyakulanda
basambilisha
ikaleni
twalasambilila
zenaida
twimbe
ukukokola
nokutendeka
ifyaonaika
kulungika
fitekwa
ilinga
amabwe
mwibuku
kupusuka
baimbile
gerari
ayakaba
nkasa
balenda
ukwishibikwa
buleni
sendeni
matololo
iyatalala
versi
ingala
alaile
fibi
tucita
abikile
culu
ngala
tunwa
twatile
ifyalo
angola
dr
india
nababili
alemba
iyakuba
kwisonde
ubufwayo
mucinefye
ukufulumuka
ubusha
wakulenga
tubelenga
afwaile
kukonkanyapo
tubwelele
abaipekanya
tuleikala
ukupola
fyebo
twilabo
thirteen
batamfishe
mipaka
kusuminisha
umwakwikala
registration
card
kuluba
asendele
tamwene
kupapata
alekele
adamu
bulayo
mukufikilisha
beminine
bumushilo
tapelele
akonkenyepo
lulingile
efintu
mapinda
verwer
imintapendwa
mumapepo
mukumfwa
amashimiko
citwa
utusebo
nokufuma
patrick
cisano
esha
jim
balakwata
abesa
misebo
ukushimikila
kupeela
enshila
ukushinshimuna
ngafintu
kukoselesha
abaishile
fitungu
august
mbala
iyiine
inyimbo
ifyakukonka
twapokelele
ubengeshime
shaiko
caishile
yaiko
yoane
fyalembwa
fyafumine
mukulanshanya
mukulundapo
tuletotela
pakupeela
tulepeela
kupitila
ukutungililwa
kutungilila
barnaba
ukupempula
yakonka
abashatetekela
abaitwa
roma
abashaishiba
cilafwilisha
vedder
bamunyinefwe
wama
alifye
engesa
shisano
milandile
belengeni
akumenye
buno
ukulunga
filecitika
mbisi
ngwena
mwenshi
tabasumina
icibumbwa
cilamuntu
wamfumu
iyii
wambe
bakese
bwela
tiye
nalakuma
ukuyamona
utushe
bwakuti
imbatumine
phone
inambala
hallo
oho
aluba
tiyeni
iciwa
mukusenda
mwisakamana
mukutandala
ninjishiba
nefintu
mwisaka
odini
mukupoka
nashimbi
ifilecitika
mpiya
inkwetekofye
nabonse
nalafwaya
natumbi
futi
aleluka
ndekabila
ukusendama
balinjeba
wise
fuma
ubupuba
nalaisa
ikalafye
ifikomo
nabalupwa
nabapongoshi
balefwa
mwatemwisha
bapeela
cikumine
ukupoka
mpendwa
tafwaya
baifwe
ndyato
kushimpa
mubomfya
natendeke
nacita
kufunda
iyalekana
baliba
kuipeelesha
icayana
ukucimfyanya
cilekabilwa
cipyacipya
ukukansha
june
akali
ilisuma
mupaka
iyali
cikuulwa
fyacitike
umofye
tacali
uwafumine
shakwikala
imilundu
umwanda
babwelele
pulogilamu
abasakamana
gavamenti
shita
intamfu
million
sansamuka
boma
panga
tulekula
ulishani
mashini
ukowa
bornface
uleenda
mpezeni
vubwi
nakupela
nashikumanina
bwakuya
twamonana
tuya
konka
shapwila
bakabweleko
injise
wemunandi
uleibukisha
mwacita
ulefwaila
lwambo
pesa
nimupepi
lembo
betelehemu
tawali
uwayanguka
kutinya
amwena
mpyani
pakupwa
kusubwa
asontele
israele
mubomfi
kubatungulula
naimbi
bakabila
umusowa
abapele
asambilishe
akabe
pampela
tulelila
ababwananyina
bumfumu
kumulondolwela
cuma
ukuteka
amono
alelolesha
twashininkisha
ukonaula
fikwatwa
icishibilo
malele
abalongana
cilatwibukisha
ukwita
libwe
mupanshi
ubwana
ibeli
batumine
bulungami
abafyalwa
alintemwa
kupokelela
yabufi
atwafwe
alangile
umutumwa
kweshiwa
atwalilila
lyafuma
mukushimika
tulondolola
abaleumfwa
fyashala
talafyalwa
pakulanga
aleshimikila
lyafumine
mukuya
abaibukila
busambi
ukusha
buntungwa
mumafunde
uwafwilile
elibwe
cile
akese
efeso
waciko
cileitwa
tempele
liko
nipa
fikope
yamushilo
usuma
ngaya
bengakwata
tukesha
email
ukupokelelamo
ifyela
muya
shimakwebo
ifileta
soseni
yakako
ifyakubomfya
natupwisha
international
l
eleven
nokucita
balemoneka
natwebwa
kukosha
ukulwisha
philippa
yalemoneka
website
mukushitisha
twalandile
fisumino
ecibusa
balibafye
icafye
shilefwaya
maseminars
ukusangwako
fipya
ukuteyanya
kubikako
ukupalana
alinga
ukucite
kwangufyanya
kutandalila
abalepita
akabila
mwilyashi
bulefwaikwa
ukwendelapamo
icilepela
bengalenga
icinga
pulitwa
nefikomo
bapimpa
abengatemwa
yakupeelafye
kubufumu
ukulundapofye
pacishinka
fikalaendelapamo
fikalipilwa
yabalelolekesha
bikamo
ukusendamo
march
cilelangisha
mwasalapo
camutwe
mwaishibana
wakumisuminisha
kuntungulushi
mulonganako
mishibilako
uwantanshi
nimu
rebekah
alelolela
bampundu
mukulangisha
ukushininkisha
cipilibula
abetwa
editors
balaba
ifilimo
ukukuula
kulubali
yonsefye
balebombela
ukutungilila
twingacita
iyakwete
thomas
uwalipo
aposeshe
umwaciba
abembuka
afyelwe
cikonko
kwashalafye
kushalikapo
ukushipa
mukwishiba
asalilepo
baipela
twasambilile
bakana
kubo
kucite
yabomba
mulukuta
milumbe
ifyalecitika
kukusambilisha
hebere
naumbi
nokufika
kuposha
nokubapela
yakutamfya
yakuya
pakupanga
tatukwete
nokukula
pabunte
wapita
nacimbi
aibukishe
tapalapita
bamineti
yayafya
uwaishile
esa
efyali
ishakuti
amupale
james
iyapita
ababana
mwacitile
twatampile
ukwakwikala
ishapita
fikulwa
nokupwa
nokukwata
munyinane
twana
bakote
lambo
cifyalilwa
baposa
cilenga
bafike
yapwile
seminar
twakumanine
uletipo
nalishibe
alebombela
nathan
ukulu
mfwaya
nkoloko
mupando
efyacitike
bapya
be
inkombe
balolekeshe
chola
kasoma
nalileka
twaleka
mukulandapo
cement
batilefye
bakashita
ukutasha
ipalo
baletontonkanya
ukupanda
iikumine
kulowa
nanina
mafiga
atampo
santi
ishikali
nafumine
basezuru
rhodesia
napwa
baika
kumufwika
ukufwayo
mafundisho
afisa
baisaima
bashifika
balamweba
amabotolo
amumona
kucinda
kapita
kwanguka
eminine
ukushipikisha
ashingilila
mukani
maini
nande
triumph
kwensha
kamweba
walaisa
buleti
walenga
twaikala
naibukisha
alawayawaya
natendeka
dona
ndetina
icabipisha
anasha
ukumucusha
nkakashi
aisafumya
alamweba
canga
naleti
balebwela
kebo
akumbatila
kupenda
apitile
banki
baletwita
kampanda
kutwalila
cipata
ulusa
calinga
bapitile
baisafuma
alelisha
cumi
balungama
ntile
natuleeya
ateka
aika
lupiya
nafwaya
kubwelelamo
alisha
sano
balonga
kucinja
broken
kumonana
mazabuka
akaana
bwanakashi
afyukile
atiina
baebele
shakonkelepo
shali
baufishe
kuupwa
makalata
tulaya
ukutalusha
bukalibukali
ubwamba
ukuyako
ukuuma
kalumendo
kashi
afumapo
aisaima
tafwa
calubana
alenwa
batampako
abaiteyanya
nkesa
mwalumbula
baponenamo
tumba
isula
ubufyashi
cindebele
apitilila
kalekale
sisita
ubufuba
naluba
fwafwa
apokele
caletele
ayasosa
yalola
bapose
ifyakusosa
akonka
bapapa
kutiina
alamuposha
balyeko
amupeele
kutuusha
icindebele
ndeita
mutanshi
ndeumfwa
yaisula
alonga
mabulangeti
kufumina
balolela
shitesheni
nampo
abutuke
nkonshi
teshibe
ninaka
ukutuusha
kutwala
nkalamba
ailuka
apusa
akabwe
ubulungu
musende
cikabe
celina
bacibusa
endele
inuni
naumfwile
ukushika
ibuku
ashifika
umusumba
akunta
kankungwe
amainsa
wiba
kalaya
mukupo
ganda
inkanda
yaikata
naikata
kuipaya
mwimba
wabekata
cee
mumo
ntila
bancita
afulumuka
ulwinelwine
bafumapo
baoca
baiko
yaibukisha
bomfwe
icisansala
mupya
bapusuka
naikalisha
ilini
mwala
kufulwa
mubi
ukubumba
fyapita
fibiye
kusokola
tubwa
shilili
iline
lyeka
fyasumina
mumwene
alelunga
aleita
amweba
nondo
lupako
ayafisa
bende
insefu
pefwasa
wipaye
fwasa
abuulapo
ilungu
cabapesha
utwali
bafula
baimine
abafwile
efilya
bamunkalamo
twashuka
ipulu
ipindo
bwati
bashumfwa
utukuni
kapopo
bafulumuka
munomba
abau
bamwane
bashimona
nsoka
mbi
twalafika
balisha
apwisha
atemwe
mufulo
shilubwense
nya
uke
kubuka
balesosa
umucila
kutasha
cimocimo
icuni
bukafukanya
alemweba
anshimikile
fyaima
isese
apona
ucita
babi
mapindo
bangalila
citente
icangalo
ndupi
mulalya
basonta
baciba
balacita
tondo
koshi
naubalika
cibiye
solye
akene
kambe
caikata
cisongo
fibolya
balayako
batoola
lukungu
misepe
icilindi
kwingisha
ukutapa
shililo
misumbi
masuku
kumulya
tabafwaya
lupeta
ingi
shakumanina
nabasenda
nkasu
kutema
kubula
icushi
cimumbwa
ukuwama
balila
yaluka
akanani
ukutumwa
cilambu
ifitwalo
baisusha
fyapya
mfungo
bacila
batasha
mapanga
kubwaice
elulimi
ningishiba
ngakuli
imitwe
bamutuma
abatalaba
ubuloshi
mpalume
icila
ibe
asange
mbale
tupinda
kashobwe
mpweto
iciminine
twilalaba
fikolwe
ukulangile
balandila
fimoneka
munkambi
takacepa
ukufumafye
nabumbi
mumwaka
cinelubali
mwalasanga
yanshiku
nabaana
linga
kuminwe
akaboko
empanga
lila
bwankoko
kukanwa
kulamba
alile
tawitika
bamutasha
mabwe
imipemene
mipemene
bwaleta
bwaya
uulwele
baani
ifyakuicingilila
isopo
mwabomfya
utushiishi
shapeelwa
ishakuicingililamo
kundapwa
ukumucena
kucifungo
tummineni
musangwa
ubwacingililwa
mucitundu
cacitika
mwasangwa
ukupatikishiwa
ifitupa
red
cross
utwalekenalekana
utwingamyafwilisha
nokusangwa
ukupana
wwwone
respectorgau
mulasangwa
pakupindulula
tawasuminishiwa
mukumuletela
ukumonawila
nabaume
mumone
mwikale
abakwa
paisa
cipondo
ilibwe
umukuni
tayali
intulo
ecikatilo
amupeela
wilaba
ilino
kwakana
lubingu
amerika
abasendwa
ulande
mutulo
kwita
icabela
ucz
twatendeke
twalebomba
ndemona
ukututinya
insofu
ukusalanganya
bakashitisha
kasalanganya
cilyafye
mumwakwe
abakale
leesa
umusonko
nokwima
twaima
baka
ngaa
akota
afwila
cilatini
party
akonkele
lwali
waishile
matundashi
nemitundu
balemwita
finga
umutembo
twakocela
ukumone
bakosha
twaiposa
fyenge
um
mutombo
bulacafye
bacimba
nicifye
epakuti
balyafye
kafwe
anaka
shinoono
akanoono
asanguka
mwansafyela
bamuleka
moolu
cayafya
candamali
fipolopolo
imfuti
kwendelamo
tufipe
labalabalaba
mukali
nku
ayasanga
alima
kaba
nuu
imfalashi
kabuka
kalifye
baletila
akesa
mpu
mupabi
impapa
iyakwa
cabapeseshe
ling
alati
mitundu
yesa
ileya
walemba
icisoli
twebeko
cinyanja
waile
yashala
ukutoloka
toloka
mucisungu
tumfwane
ishina'
naliya
naulwala
mfuba
umwafi
batoota
apepapo
shamungole
bakalume
amonekele
owe
kapambwe
mulambi
mputa
mukasanga
lucelenanga
uwauma
mulishani
mubongola
ninga
nangeniko
sacha
ndesambilila
pikica
icipampa
kalashi
inkonde
temucinshi
ifyakunwa
nashi
ifipuna
sikota
nacibuuka
bakaipeela
imbeni
utwipi
mwatemwa
mwabomfyako
umuseke
twaciya
ukuma
balilwile
muleshitisha
yalifyele
sunkutuwamilimo
upila
bwaisaca
cebele
yaa
feshiti
mulempelelamofye
iyee
ngata
chikolwa
amba
nkutole
ponailaee
nkutoleee
eto
bafisa
nafwe
babulile
kupa
sanga
ukuboma
insupa
kuntamo
yeee
emwaume
utubalala
ukaye
aolola
bashimya
canca
mumputa
icipute
mumutenge
kabilibita
kaipela
cibote
cishipa
utale
wilalekela
balekwangashisha
bakonawila
mulembelesha
nganafulwa
nalishupa
mwayangala
nakwanisha
tamungafwile
balekufwaila
waibikilishapo
uwakupela
nefingi
akupeela
watendeka
nokucetekela
ubushali
ukuipekanishisha
ukubombeka
ukupamfya
abalekubombela
ngawapatikisha
cakuletela
nganafikulinga
mwilanjipusha
ukasokoloka
wingabomfya
baisakupoka
ewingakutentemba
alibipisha
alanunka
uutuminwe
ukucindikwa
talemoneka
filondoloke
ngataulile
ngabakusokako
balekwebaula
engaicenjelesha
akasokoloke
ukuyashimika
bamupatilapo
isoselwa
pakucita
uuilanga
uwakaele
aisaikatwa
wacenjele
mwakusempukila
ifitumbuka
mukubepa
ngawabepa
walebepafye
ibafye
uletungulula
uipekanye
bakufulunganishisha
cakukalipa
ukutekanya
watontonkanya
taulacita
bakutashe
mwalekana
ukusekesha
wafwapofye
ubwembya
yabanakashi
pakubomba
ulukulu
wamwene
pakupwisha
tabatemwana
kubulwa
kunshiku
citipu
ukuitakisha
wishibile
takuba
balekwafwa
wacitile
wikesha
pamilimo
alikwatako
icakaniko
bubamfi
bumoneka
ubutani
ayafwilisha
bamwafwile
ngafyakosa
akolwa
nefyankama
waisanga
telyonse
nokwasuka
ubombele
ngawakula
tawakatale
acenjela
bweni
efingalenga
nefingamuletelela
kunsala
ubupingushi
ngawafusha
ukuiletelela
pabuta
watila
ubwishibilo
wienekela
wabombele
tafikokola
cuni
ulefwaisha
sumu
kumulume
ifyakufuta
uwaina
wapanga
ndya
kufilubo
umushaba
tecalo
ukutemwana
kulacusha
uleangala
ubwayafya
mwilaesha
iifwile
utumilimo
babutuka
bufibufi
alafwilisha
abesha
uwaikala
mumayanda
bakutuma
ukutuka
bakupoka
kubuko
uwafuuka
mutembo
uushaba
nakapatulula
cabakalamba
emusango
umunntu
uwamutembo
uupokelela
incenjeshi
ubupumbu
pakulima
abapongoshi
umupupu
akabwela
ukulefuma
wafyendela
nokuficulila
icishilamoneka
caluba
usendele
icisendo
icafina
balomfwa
ifingalenga
ngawaupa
busoko
ukusendapofye
ulebombeshafye
akusungila
ukashuka
temwine
kubenda
ukunoku
wakwenda
wafwailisha
ukutalikana
ngabakutuma
kuilishanya
cakwansha
uwaipekanya
umwanakshi
waishibisha
ukubalilapo
ndubulwila
ampusushako
icacila
ukucincintila
kubanankwe
ukukanda
pacilubo
ukuletelela
uwingakusunga
ukufwila
wasosa
ifyakale
uwatumpa
ifyayanguka
efyayafya
nokubombela
wabipa
pakulubulula
uuleya
tasala
baishibile
ukupamfiwa
ndekweba
yamushi
akabepesho
uwakwishiba
alekupela
tawatala
ukukabushanya
uyumfwila
abakukupokolola
mipontomiponto
ilamba
nefyuma
ndai
aipekanya
fyakosa
ushilamona
fisungishe
bwakunse
uwalekelesha
imifwaile
balelosha
ukufumyapo
balelwila
ukwikatana
nokumfwana
nomunankwe
ciwame
cibipe
kumana
bulaletelela
umuya
tamulingile
pakonka
shiko
ekalafye
abakaele
ushumfwa
ngoleenda
ukukaana
ukususha
ukwebaula
ilenga
kulandalanda
alakwata
uuleipililika
ishamulandu
ukukumbwa
iyakosa
pamuntu
nokumoneka
ifyalondoloka
uubombesha
inkashi
umupuupu
bwacifyalilwa
ushitusha
tekanya
icililo
nokupula
basubila
uununka
uwishiba
uwakokola
uutunganishiwa
mukashita
uwafyalwa
aluka
ukusekwa
cakubalilapo
wakuposha
pabulendo
kumbali
abakukwafwa
bakakucitila
tanshi
ukupususha
waculafye
nakufintu
nensala
uwamucinshi
nokwafwana
ucimfye
ngataukwete
malendo
tukabomba
alalekelapo
alapusuka
uikaliha
kabolala
mipamba
ngali
nomubili
kumwana
ukukandwa
tabatasha
balesa
ifyabipa
abafika
nyenda
casuka
kuliko
tayasala
yomfwafye
ulapususha
mumafya
ayakosa
alabe
waculile
nokuleta
abanaka
shisuma
ebe
ushakafikilishe
washile
ukutumpika
umutekatima
apaala
uwacifwapo
atutubuka
pacipuna
wansoni
bwatwafwa
kumfwe
cikasokolola
ukuloba
mwacimfya
amasanso
pamenso
kubakalamba
nifilya
uwenda
ukupendela
taulabumona
umupamba
mubushiku
nomutima
kumitima
ukusonsomba
tabalati
uushimonafye
akashe
ukuntu
umfwafye
ecimo
nabonsefye
fibula
finefine
uwikala
ifyakwikalilamo
cibombelo
muceni
nokukalipakalipa
uwashama
ukulabako
ukushukilamo
nokupela
eshibikwe
yamukashi
amumwena
acito
utemenwe
ubwakuiletelelafye
mpwishe
ukumonekela
mwingakonka
ukushako
alelanga
ukutumpa
ulukasa
ukuseka
ukwendela
wasula
napafita
ulunono
teulya
uuya
aletandanye
akacone
shikamubwesha
myakwe
ukabwela
ngamwamona
uunono
ukupya
icimusango
cakuposa
musalula
ukukwatakofye
efwa
ashimike
kwalaba
ulecindika
ngaba
alufya
balekwanisha
amwishiba
nobutani
aculilamo
ukwafwilishako
ukuliisha
kulalenga
iyakakata
wasambililako
naiwewine
ukukupoka
ufikilishe
emwine
mukulunga
ilefwa
abeshibe
yesamo
naulufyanya
ipusha
ifipuba
ukumutemwa
bepike
ukumwa
ngolelya
waluse
walinga
lebomba
akacabecabe
pabwelu
balebelenga
filetulangako
kalandu
konda
ubikemo
pindo
wapyako
kwisafika
ubuluba
amabuula
ayapya
kunwako
buci
imoneka
kukoma
buba
acepa
utusembe
balanga
kwangalila
kukuula
baimika
bakakila
bwakosa
ifiibi
basunga
icakonkapo
bepikile
amansansa
babeba
ileenda
kubumba
amafwasa
balashimika
icikuuku
balatasha
tabangalako
fifula
umuli
itumba
tufyani
icilyo
utumpolyo
umumbu
utumakasa
kwafuma
mitengo
utwatwa
balinganya
bapuma
icikwa
kakota
kuyatula
balepaya
nakabushe
akalume
kalombwela
yafwa
mpepa
bailile
londo
acincila
alabamba
uwinewine
mwafita
abapalu
tashilya
basosela
tabashamo
fyalilekana
ilacepako
abakuteya
kupekanishishalibela
tukalundwe
tubalala
shingila
balesapika
fyulu
mushilinshi
uwalengula
shingilapo
bemusha
balafwaila
kumupembela
alengula
asebela
shifumina
iciliba
acileta
asebele
kubikila
kanamumpanda
apyatile
kalushishi
akakilako
kukanalesha
ukukulika
kuliteka
bwaikalila
wapalamisha
autinta
waisafumina
lyaisa
shintilila
lyasama
aupomba
baleteya
imishita
itwipaya
nkutwale
kwatalala
ifilwani
fyacepako
twatolako
akesholo
twaisamyangula
watensha
bwaletela
canunkila
kurnona
yacincila
mbule
yaingila
yaputula
kufutuka
apakushanshisha
kufwanta
ilafwaya
yasha
iibiye
naifwantwa
talyateyelwe
shasendamo
ubulyo
i
o
wasuma
fitalale
yaleta
wanshila
shibwalya
bacifwaya
atinta
nyenye
tabaleka
yamoyamo
imisana
katape
tubutuke
kawa
apasensebuka
kasosa
uwashinguluka
baikatana
tulembele
tabalipo
alumbula
alasamuna
fyacilacita
basendama
bakamukwamba
akumbile
mapipo
naipusha
alesha
utile
batwebele
luombe
malunda
alepepapo
mutumuna
kaela
ifinono
ifyabela
mamba
nkunda
amuti
uwafwa
nayashala
namumona
tukwete
muleti
ukwisuka
mipindo
icabuuta
abukila
abuuka
lukose
cibwela
tusha
atumona
caisala
tulele
pabe
kukosho
tumwene
natwingilila
mucinshimucinshi
tubukile
acingilila
pambilibili
ngoyu
icayakisha
ukwaka
abalile
ukupepela
abalilepo
abyelemo
amasaka
ifipushi
imyungu
alefuma
alefyoca
ampele
balelima
kape
tucilemba
tacawama
basunguka
ateshe
alola
apatali
bamushikile
walibola
walebomba
teyo
amalampi
bomi
muba
yaleka
umbiumbi
muleyangala
ilemutamfya
mwatampa
kupupuka
ukwitilila
wabwelela
ushile
uleyangala
wacilala
ishiba
filoto
wangala
walaenda
ukucula
umulungulwa
kulanguluka
ukafilwa
fikali
alicila
balipeye
tulalya
tufwaya
talekele
fyaletefuma
ifyafunda
baleponenwa
tabalelima
balebakilwa
yaletuma
kulomba
alebapeela
balwile
baswahili
alikenye
ukubapeela
salula
tafimenene
bakapate
bakacite
uwapishishe
awilile
wamukobekele
nshakopwe
kusalule
kankabebe
bakacila
ukuntemwa
ishasalulwa
yakunta
kuicusha
tafyamenene
yacila
atumbule
mukalima
mukakopole
tafyakamene
amutumina
ifyasalulwa
ifyaipikwa
yafulwa
abakuyaipaya
balekosesha
wafisanga
tabamushikile
abolele
mwalabomba
twalabomba
ukuloka
nalatampa
ukutweba
bwelela
wakonkosha
konkosha
mung'anda
ukutusha
mwanwa
tekuya
mwabwela
nakulile
lwimba
ukutampa
wende
natampile
iredi
tubwele
tweshe
tucitile
mucite
ukulangisha
nyanta
nalimitemwa
baleshita
nchito
alitemwisha
ubulimi
yamfula
ncita
cilefwaika
bodi
nalakupela
napwisha
naucelwa
wikala
tamwacilya
mwacilya
twacilya
uwisa
kunaka
mwilembo
tulemonapo
ukusondwelela
baibimba
mukupyungila
mubutantiko
bengaba
kuipakisha
natusambilile
nokubika
nokwamba
nkunta
imilale
balalungika
yawa
aimbile
ifyakwisa
kuumfwa
ntampulo
afinike
shamfumu
ukunwisha
icilaka
sambilileni
ulubuuto
ififulo
ukumana
bacemi
eseke
poka
ayatalala
kufyefyetuka
ulwacincila
uulebomfeshiwa
twalyumfwa
indeke
shilafwilisha
lyantanshi
bwise
bamalaika
nokusakamana
twafikilisha
mulesanga
twalipusuka
fisa
february
aleba
yakowela
tulelolekeshapo
nokutamfya
mutuule
shabola
ifiitwa
abasumina
ngumfwile
mupu
uwakaba
tulaibepa
wacishinka
alacita
imicila
twasumina
tumpundu
wafyo
tatuli
abaluba
conference
ford
icipendo
kenya
malawi
madagascar
mozambique
nigeria
baendela
napopene
alolenkene
namafya
kukupepa
imbela
mukusala
awile
nokupepa
mukupepa
fyaisa
ilefwaya
iyikalamba
yaliko
icakwafwilisha
yakapatikila
tulasambilisha
fernando
nouwen
